Саракташ2/src/Documents/ПеремещениеТоваров/ПеремещениеТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПеремещениеТоваров</name>
  <basedOn>Document.ЗаказПокупателя</basedOn>
  <registerRecords>AccumulationRegister.Запасы</registerRecords>
  <registerRecords>AccumulationRegister.СебестоимостьТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ЗапасыПоСерийнымНомерам</registerRecords>
  <attributes>
    <name>СкладОтправитель</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПолучатель</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.ТипЦена</types>
      </type>
    </attributes>
    <attributes>
      <name>СкладПолучатель</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>НовыйАртикул</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ВязальщицаНаСайте</name>
      <type>
        <types>CatalogRef.Мастерицы</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>РезультатПриемки</name>
      <type>
        <types>CatalogRef.РезультатыПриемки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СерийныеНомера</name>
    <attributes>
      <name>КлючСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Недочеты</name>
    <attributes>
      <name>КлючСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Недочет</name>
      <type>
        <types>CatalogRef.НедочетыПриПриемке</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Саракташ2/src/AccumulationRegisters/Запасы/Запасы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Запасы</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Саракташ2/src/AccumulationRegisters/ЗапасыПоСерийнымНомерам/ЗапасыПоСерийнымНомерам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗапасыПоСерийнымНомерам</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Саракташ2/src/Catalogs/Склады/Склады.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Склады</name>
  <predefined>
    <items>
      <name>РынокСаракташ</name>
      <description>Рынок Саракташ</description>
    </items>
    <items>
      <name>Саракташ</name>
      <description>Саракташ</description>
    </items>
  </predefined>
  <attributes>
    <name>ВыгружатьОстаткиСерийныхНомеров</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Саракташ2/src/Documents/ПеремещениеТоваров/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ДокументОснование.Видимость = ЗначениеЗаполнено(Объект.ДокументОснование);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)   	
	  
	Если Объект.СкладОтправитель = ПредопределенноеЗначение("Справочник.Склады.Саракташ") 
		Или Объект.СкладОтправитель = ПредопределенноеЗначение("Справочник.Склады.РынокСаракташ") Тогда 
		
		ПараметрыФормы = Новый Структура("Ключ", Объект.Ссылка); 
		ПараметрыФормы.Вставить("ЗначенияЗаполнения"
		, Новый Структура("СкладОтправитель", Объект.СкладОтправитель));
		ОткрытьФорму("Документ.ПеремещениеТоваров.Форма.ФормаПеремещенияСПроизводства", ПараметрыФормы);
		
		Отказ = Истина;
		Возврат;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)	
	Отказ = Истина; // добавлять Подбором или по остаткам, чтобы исключить ошибки 	
КонецПроцедуры

Процедура ЗаполнитьПоОстаткамНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗапасыОстатки.Номенклатура КАК Номенклатура,
	|	ЗапасыОстатки.КоличествоОстаток КАК Количество,
	|	ЗапасыПоСерийнымНомерамОстатки.СерийныйНомер КАК СерийныйНомер,
	|	ЗапасыПоСерийнымНомерамОстатки.СерийныйНомер.Бирка КАК Бирка,
	|	ЗапасыПоСерийнымНомерамОстатки.СерийныйНомер.Наименование КАК СерийныйНомерНаименование,
	|	ЗапасыОстатки.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	|ИЗ
	|	РегистрНакопления.Запасы.Остатки(, Склад = &Склад) КАК ЗапасыОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗапасыПоСерийнымНомерам.Остатки(, Склад = &Склад) КАК ЗапасыПоСерийнымНомерамОстатки
	|		ПО ЗапасыОстатки.Номенклатура = ЗапасыПоСерийнымНомерамОстатки.СерийныйНомер.Владелец
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура,
	|	СерийныйНомерНаименование
	|ИТОГИ
	|	СУММА(Количество),
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СерийныйНомер)
	|ПО
	|	Номенклатура,
	|	Бирка";
	Запрос.УстановитьПараметр("Склад", Объект.СкладОтправитель);
	
	Объект.Товары.Очистить();
	Объект.СерийныеНомера.Очистить();
	Объект.Недочеты.Очистить();
	
	ВыборкаТовары = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаТовары.Следующий() Цикл
		
		НоваяСтрокаТовары = Объект.Товары.Добавить();
		НоваяСтрокаТовары.Номенклатура = ВыборкаТовары.Номеклатура;
		НоваяСтрокаТовары.ЕдиницаИзмерения 	= ВыборкаТовары.ЕдиницаИзмерения;
		НоваяСтрокаТовары.КлючСтроки 		= Новый УникальныйИдентификатор;
		
		ВыборкаБирки = ВыборкаТовары.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаБирки.Следующий() Цикл			
			
			ВыборкаСерийники = ВыборкаБирки.Выбрать();
			Пока ВыборкаСерийники.Следующий() Цикл			
				НоваяСтрокаСерийник = Объект.СерийныеНомера.Добавить();	
				НоваяСтрокаСерийник.КлючСтроки 		= НоваяСтрокаТовары.КлючСтроки;	
				НоваяСтрокаСерийник.СерийныйНомер 	= ВыборкаСерийники.СерийныйНомер;
			КонецЦикла;		
		КонецЦикла;		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоОстаткам(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.СкладОтправитель) Тогда
		ПоказатьПредупреждение(, "Не указан склад, с которого перемещают товар");
		Возврат;
	КонецЕсли;
	
	ОбработчикОповещения = Новый ОписаниеОповещения("ПерезаполнитьТоварыПоОстаткамПродолжение", ЭтаФорма);
	Если Объект.Товары.Количество() > 0 Тогда
		ПоказатьВопрос(ОбработчикОповещения, "Не указан склад, с которого перемещают товар", РежимДиалогаВопрос.ОКОтмена);
	Иначе
		ВыполнитьОбработкуОповещения(ОбработчикОповещения, КодВозвратаДиалога.ОК);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьТоварыПоОстаткамПродолжение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса <> КодВозвратаДиалога.ОК Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПоОстаткамНаСервере();

КонецПроцедуры
